---
kind: method
id: M:Autodesk.Revit.DB.LeaderArray.#ctor
source: html/d98e40b3-d2c6-4b5d-9b39-1c6ec6020000.htm
---
# Autodesk.Revit.DB.LeaderArray.#ctor Method

Initializes a new instance of the LeaderArray class

## Syntax (C#)
```csharp
public LeaderArray()
```